Repository: carlosscastillo/LotteryClient
Catalog: Properties/Langs/Lang.*.resx
Languages: es

# LobbyExceptionNotInLobby
source: Server says you are not in an active lobby.
es: El servidor indica que no estás en un lobby activo.

# LobbyExceptionSessionExpired
source: Your session has expired.
es: Tu sesión ha expirado.

# LobbyExceptionUserOffline
source: User is currently offline.
es: El usuario no está conectado actualmente.

# LobbyExceptionUserBusy
source: User is already playing or inside a lobby.
es: El usuario ya se encuentra jugando o dentro de un lobby.

# LobbyExceptionActionDenied
source: You cannot kick yourself.
es: No puedes expulsarte a ti mismo.

# LobbyExceptionLobbyNotFound
source: The lobby no longer exists.
es: El lobby ya no existe.

# LobbyExceptionForbiddenWord
source: Inappropriate language detected!
es: ¡Lenguaje inapropiado detectado!

# LobbyExceptionGuestRestricted
source: Guests cannot invite friends.
es: No puedes invitar amigos siendo invitado.

# LobbyFriendGenericName
source: your friend
es: tu amigo

# LobbyInviteSent
source: Invitation sent to {0}.
es: Invitación enviada a {0}.

# LobbyChatPlayerJoined
source: --- {0} has joined. ---
es: --- {0} se ha unido. ---

# LobbyChatPlayerLeft
source: --- {0} has left. ---
es: --- {0} se ha ido. ---

# LobbyChatPlayerKicked
source: --- {0} has been kicked. ---
es: --- {0} ha sido expulsado. ---

# LobbyMessageYouKicked
source: You have been kicked from the lobby by the host.
es: Has sido expulsado del lobby por el host.

# LobbyTitleKicked
source: Kicked
es: Expulsado

# LobbyMessageHostClosed
source: The host has closed the lobby.
es: El host ha cerrado el lobby.

# LobbyTitleClosed
source: Lobby Closed
es: Lobby Cerrado

# GuestLoginInvalidNickname
source: The username is invalid.
es: El nombre de usuario no es válido.

# GuestLoginInvalidLength
source: Your nickname must be between 4 and 20 characters.
es: Tu apodo debe tener entre 4 y 20 caracteres.

# GuestLoginEmptyNickname
source: Please enter a nickname.
es: Por favor ingresa un apodo.

# GuestLoginInvalidFormat
source: Your nickname contains invalid characters.
es: Tu apodo contiene caracteres inválidos.

# GuestLoginGenericError
source: Could not create guest session.
es: No se pudo crear la sesión de invitado.

# LoginInvalidCredentials
source: Incorrect username or password.
es: El usuario o la contraseña son incorrectos.

# LoginAccountLocked
source: Your account has been temporarily locked due to too many failed attempts.
es: Tu cuenta ha sido bloqueada temporalmente por demasiados intentos fallidos.

# LoginAlreadyConnected
source: This user already has an active session elsewhere.
es: Este usuario ya tiene una sesión activa en otro lugar.

# LoginIncompleteData
source: Please enter username and password.
es: Por favor, ingresa usuario y contraseña.

# LoginValidationTitle
source: Validation
es: Validación

# LoginValidationMessage
source: Please correct the following errors:
es: Corrige los siguientes errores:

# LoginGenericError
source: Unknown error retrieving user data.
es: Error desconocido al obtener datos del usuario.

# RegisterUserDuplicate
source: Nickname or email already registered.
es: El apodo o el correo electrónico ya están registrados.

# RegisterEmailSendFailed
source: Could not send verification email.
es: No pudimos enviar el correo de verificación.

# RegisterVerifyError
source: There was a problem validating your code.
es: Hubo un problema validando tu código.

# RegisterBadRequest
source: Some data is invalid.
es: Algunos datos son inválidos.

# RegisterPasswordsDoNotMatch
source: Passwords do not match.
es: Las contraseñas no coinciden.

# RegisterPasswordErrorTitle
source: Password Error
es: Error de Contraseña

# RegisterVerificationCodeSent
source: A verification code was sent to your email.
es: Se envió un código de verificación a tu correo.

# RegisterGenericError
source: Could not register. Check your data.
es: No se pudo registrar. Verifica tus datos.

# RegisterInvalidCodeTitle
source: Invalid Code
es: Código inválido

# RegisterCodeExpiredOrIncorrect
source: Code is incorrect or has expired.
es: El código es incorrecto o ha expirado.

# RegisterVerificationFailedTitle
source: Verification Failed
es: Verificación fallida

# LobbyKickConfirmationTitle
source: Kick Player
es: Expulsar Jugador

# SelectBoardLabelTitle
source: Select your board
es: Selecciona tu tablero

# SelectBoardLabelBoard
source: Board #
es: Tablero #

# SelectBoardConfirmSelection
source: Confirm Selection
es: Confirmar Selección

# SelectBoardExceptionSelectABoard
source: Please select a board.
es: Por favor, selecciona un tablero.

# SelectTokenLabelTitle
source: Choose your markers
es: Elige tus fichas

# SelectTokenLabelMarkersCorn
source: Corn
es: Maíz

# SelectTokenButtonConfirmMarkers
source: Confirm Markers
es: Confirmar Fichas

# SelectTokenSelectYourMarkers
source: Please select your markers.
es: Por favor, selecciona tus fichas.

# LobbyLabelBoard
source: Board
es: Tablero

# LobbyLabelMarkers
source: Markers
es: Fichas

# SelectBoardLabelBoardIndividual
source: Board #{0}
es: Tablero #{0}

# LeaderboardPlayerLabel
source: Player
es: Jugador

# LeaderboardCurrentUserLabel
source: (You)
es: (Tú)

# SelectBoardMessageSelectAvailable
source: Please select an available board.
es: Por favor selecciona un tablero disponible

# GameMessageBoxFalseLoteriaFailed
source: False Lottery failed!
es: ¡Falsa Lotería fallida!

# GameMessageBoxFalseLoteriaSuccess
source: False Lottery successful!
es: ¡Falsa Lotería exitosa!

# GlobalMessageBoxTitleInfo
source: Information
es: Información

# RegisterServerTimeout
source: Server timeout
es: Tiempo de espera del servidor agotado

# SettingsLanguage
source: Language
es: Idioma

# GlobalExceptionConnectionLostMessage
source: The connection to the server has been lost.
es: Se ha perdido la conexión con el servidor.

# GlobalExceptionConnectionDatabaseMessage
source: There is no connection to the database.
es: No hay conexión con la base de datos.

# ValidationTwitterMaxLength
source: Twitter/X username must be shorter than 16 characters.
es: El usuario de Twitter/X debe tener menos de 16 caracteres.

# ValidationTwitterFormat
source: Twitter/X username may only contain letters, numbers, and underscores.
es: El usuario de Twitter/X solo puede contener letras, números y guiones bajos.

# ValidationInstagramMaxLength
source: Instagram username must be shorter than 31 characters.
es: El usuario de Instagram debe tener menos de 31 caracteres.

# ValidationInstagramFormat
source: Instagram username may only contain letters, numbers, dots, and underscores.
es: El usuario de Instagram solo puede contener letras, números, puntos y guiones bajos.

# Validation_TikTok_MinLength
source: TikTok username must be at least 2 characters long.
es: El usuario de TikTok debe tener al menos 2 caracteres.

# ValidationTikTokMaxLength
source: TikTok username must be shorter than 25 characters.
es: El usuario de TikTok debe tener menos de 25 caracteres.

# ValidationTikTokFormat
source: TikTok username may only contain letters, numbers, dots, and underscores.
es: El usuario de TikTok solo puede contener letras, números, puntos y guiones bajos.

# ValidationFacebookMaxLength
source: Facebook path must be shorter than 51 characters.
es: La ruta de Facebook debe tener menos de 51 caracteres.

# Validation_Facebook_Format
source: Facebook path contains invalid characters.
es: La ruta de Facebook contiene caracteres inválidos.

# LobbyStartGameNotEnoughPlayers
source: At least 2 players are needed to start the game.
es: Se necesitan al menos 2 jugadores para iniciar la partida.
