Repository: carlosscastillo/LotteryClient
Catalog: Properties/Langs/Lang.*.resx
Languages: es

# ChangePasswordButtonCreateNewPassword
source: Create new password
es: Crear nueva contraseña

# ChangePasswordLabelCurrentPassword
source: Current password
es: Contraseña actual

# GlobalTagPassword
source: Change Password
es: Cambiar Contraseña

# CreateLobbyLabelCardDisplayOneSecond
source: 1 Second
es: 1 Segundo

# CreateLobbyLabelCardDisplayThreeSeconds
source: 3 Seconds
es: 3 Segundos

# CreateLobbyLabelCardDisplayTime
source: Card display time
es: Tiempo de aparición de las cartas

# CreateLobbyLabelCardDisplayTwoSeconds
source: 2 Seconds
es: 2 Segundos

# CreateLobbyLabelCardImage
source: Card image
es: Imagen de cartas

# LobbyLabelGameMode
source: Game mode
es: Modo de juego

# CreateLobbyLabelGameModeCenter
source: Center
es: Centro

# CreateLobbyLabelGameModeCorners
source: Corners
es: Esquinas

# CreateLobbyLabelGameModeDiagonals
source: Diagonals
es: Diagonales

# CreateLobbyLabelGameModeFrame
source: Frame
es: Marco

# CreateLobbyLabelGameModeMegaLottery
source: Mega Lottery
es: Mega Lotería

# CreateLobbyLabelGameModeStandard
source: Standard
es: Normal

# CreateLobbyLabelGameModeUnfairLottery
source: Unfair Lottery
es: Lotería Injusta

# CreateLobbyLabelMarkers
source: Markers
es: Fichas

# SelectTokenLabelMarkersBeans
source: Beans
es: Frijoles

# SelectTokenLabelMarkersBottleCaps
source: Bottle Caps
es: Corcholatas

# SelectTokenLabelMarkersCoins
source: Coins
es: Monedas

# CreateLobbyLabelMarkersCorn
source: Corn
es: Maíz

# CreateLobbyLabelMarkersPaperBalls
source: Paper Balls
es: Bolitas de Papel

# CreateLobbyLabelSound
source: Sound
es: Sonido

# GlobalButtonCreateLobby
source: Create Lobby
es: Crear Sala

# GlobalTagChangeEmail
source: Change email
es: Cambiar correo electrónico

# CustomizeProfileLabelAvatar
source: Avatar
es: Foto de Perfil

# CustomizeProfileLabelBackground
source: Background
es: Color de Fondo

# CustomizeProfileLabelDescription
source: By pressing "Continue", a verification code will be sent to the provided email address.
es: Al presionar “Continuar”, se enviará un código de verificación a la dirección de correo electrónico proporcionada.

# CustomizeProfileLabelEditDetails
source: Edit and update your profile information.
es: Edita y actualiza la información de tu perfil.

# CustomizeProfileLabelEmailUpdated
source: Your email address has been successfully updated
es: Tu correo electrónico se ha modificado correctamente

# CustomizeProfileLabelNewEmailAddress
source: New email address
es: Nueva dirección de correo electrónico

# CustomizeProfileLabelProfileDetails
source: Profile Details
es: Datos del Perfil

# CustomizeProfileLabelSelectAvatar
source: Select your avatar
es: Selecciona tu avatar

# CustomizeProfileLabelTitle
source: Customize Profile
es: Personalizar Perfil

# en
source: English
es: Inglés

# es
source: Spanish
es: Español

# GlobalMessageBoxTitleExit
source: Exit
es: Salir

# GlobalButtonOK
source: OK
es: Aceptar

# GlobalButtonBack
source: Back
es: Regresar

# GlobalButtonContinue
source: Continue
es: Continuar

# GlobalButtonSaveChanges
source: Save
es: Guardar

# GlobalButtonSignUp
source: Sign Up
es: Registrarme

# GlobalButtonStart
source: Start
es: Iniciar

# GlobalButtonVerificationCode
source: Verification Code
es: Código de Verificación

# GlobalButtonVerifyCode
source: Verify Code
es: Verificar Código

# GlobalLabelConfirmPassword
source: Confirm Password
es: Confirmar Contraseña

# GlobalLabelDetailsToContinue
source: Enter your details to continue
es: Ingresa tus datos para continuar

# GlobalLabelEmail
source: Email
es: Correo Electrónico

# GlobalLabelLobby
source: Lobby
es: Sala

# GlobalLabelMaternalLastName
source: Paternal Last Name
es: Apellido Materno

# GlobalLabelName
source: Name(s)
es: Nombre(s)

# GlobalLabelNewPassword
source: New Password
es: Nueva Contraseña

# GlobalLabelNickname
source: Nickname
es: Apodo

# GlobalLabelPassword
source: Password
es: Contraseña

# GlobalLabelPaternalLastName
source: Paternal Last Name
es: Apellido Paterno

# GlobalLabelPlayers
source: Players
es: Jugadores

# GlobalLabelVerificationCode
source: We’ve sent a code to
es: Hemos enviado un código a

# GlobalTagYes
source: Yes
es: Si

# GuestSignUpLabelNickname
source: Enter your nickname
es: Ingresa tu apodo

# GuestSignUpLabelTitle
source: Play as guest
es: Iniciar como invitado

# InviteFriendsButtonCopy
source: Copy
es: Copiar

# InviteFriendsButtonInviteCode
source: Invite Code
es: Código de Invitación

# GobalButtonSend
source: Send
es: Enviar

# InviteFriendsLabelCopyInviteCode
source: Copy your invite code
es: Copia tu código de invitación

# InviteFriendsLabelSendEmail
source: Send by email
es: Enviar por correo electrónico

# InviteFriendsLabelTitle
source: Invite your friend
es: Invita a tu amigo

# JoinLobbyButtonJoin
source: Join lobby
es: Unirme a la sala

# JoinLobbyLabelDetails
source: Enter lobby code
es: Ingresa el código de la sala

# JoinLobbyLabelLobbyCode
source: Lobby Code
es: Código de la sala

# GlobalButtonJoinLobby
source: Join Lobby
es: Unirse a una sala

# LobbyButtonKick
source: Kick
es: Expulsar

# KickPlayerLabelKickOut
source: Kick Out
es: Expulsión

# LobbyKickConfirmationMessage
source: Are you sure you want to kick {0}? The player will not be allowed to re-enter this lobby.
es: ¿Estás seguro de que deseas expulsar a {0}? El jugador no podrá volver a entrar a este lobby.

# KickPlayerTextFieldChat
source: Type a message
es: Escribe un mensaje

source: Load main
es: Ir a inicio

# LoginButtonForgotMyPassword
source: Forgot my password
es: Olvidé mi contraseña

# LoginButtonSignUp
source: New here? Sign up
es: Soy nuevo, quiero registrarme

# LoginLabelEnterDetail
source: Enter your details to log in
es: Ingresa tus datos para iniciar

# LoginLabelTitle
source: Login
es: Inicio de Sesión

# RecoverPasswordButtonConfirm
source: Confirm
es: Confirmar

# RecoverPasswordButtonGoToLogin
source: Go to login
es: Ir a inicio de sesión

# RecoverPasswordButtonRecoverPassword
source: Recover password
es: Recuperar contraseña

# RecoverPasswordLabelDescription
source: By pressing "Recover password", a verification code will be sent to the provided email address.
es: Al presionar “Recuperar contraseña”, se enviará un código de verificación a la dirección de correo electrónico proporcionada.

# RecoverPasswordLabelNewPassword
source: Enter your new password to continue
es: Ingresa tu nueva contraseña para continuar

# RecoverPasswordLabelPasswordUpdated
source: Your password has been updated successfully. You can now log in.
es: Tu contraseña se ha actualizado correctamente, ya puedes iniciar sesión

# RecoverPasswordLabelTitle
source: Recover Password
es: Recuperar Contraseña

# UserSignUpLabelDetails
source: Fill in your details to sign up
es: Ingresa tus datos para registrarte

# UserSignUpLabelRegistrationComplete
source: Your registration was successful. Welcome,
es: Tu registro ha sido completado exitosamente. Bienvenido

# UserSignUpLabelTitle
source: Sign Up
es: Registro de Usuario

# LeaderboardLabelTitle
source: Leaderboard
es: Tabla de clasificación

# LeaderboardRankLabel
source: Rank
es: Posición

# LeaderboardScoreLabel
source: Score
es: Puntuación

# FriendsListLabelTitle
source: Friend List
es: Lista de amigos

# InviteFriendButton
source: Invite friend
es: Invitar a un amigo

# DeleteFriendButton
source: Remove friend
es: Eliminar amigo

# CustomizeProfileButtonChangeAvatar
source: Change Avatar
es: Cambiar Avatar

# CustomizeProfileButtonChangeNickname
source: Change Nickname
es: Cambiar Apodo

# CustomizeProfileButtonChangeEmail
source: Change Email
es: Cambiar Correo

# CustomizeProfileButtonChangePassword
source: Change Password
es: Cambiar Contraseña

# MainMenuButtonProfile
source: Profile
es: Perfil

# MainMenuButtonFriends
source: Friends
es: Amigos

# MainMenuButtonSettings
source: Settings
es: Configuración

# CustomizeProfileLabelSocialMedia
source: Social Media
es: Redes Sociales

# GlobalButtonCancel
source: Cancel
es: Cancelar

# GlobalButtonEdit
source: Edit
es: Editar

# ChangePasswordLabelSuccessfullyChanged
source: Your password has been successfully changed
es: Tu contraseña se ha modificado correctamente

# WinnerLabelTitle
source: Winner
es: Ganador

# WinnerButtonFalseWinner
source: False Winner
es: Falso Ganador

# GlobalButtonReject
source: Reject
es: Rechazar

# InviteFriendsLabelMyFriends
source: My Friends
es: Mis Amigos

# InviteFriendsLabelSearchPlayer
source: Search Player
es: Buscar Jugador

# InviteFriendsButtonSearch
source: Search
es: Buscar

# InviteFriendsButtonAdd
source: Add
es: Añadir

# InviteFriendsButtonCancelRequest
source: Cancel Request
es: Cancelar Solicitud

# InviteFriendsButtonViewRequest
source: See friend requests
es: Ver solicitudes de amistad

# LobbyButtonInvite
source: Invite
es: Invitar

# LobbyButtonViewPlayers
source: View Players
es: Ver Jugadores

# LobbyButtonLeaveLobby
source: Leave Lobby
es: Salir del Lobby

# LobbyButtonStartGame
source: Start Game
es: Empezar Partida

# LobbyLabelInviteFriends
source: Invite Friends
es: Invitar Amigos

# CardTextBlockArnold
source: Arnold Shortman
es: Arnold

# CardTextBlockBlossom
source: Blossom
es: Bombón

# CardTextBlockBrain
source: Brain
es: Cerebro

# CardTextBlockBubbles
source: Bubbles
es: Burbuja

# CardTextBlockButtercup
source: Buttercup
es: Bellota

# CardTextBlockChuckieFinster
source: Chuckie Finster
es: Carlitos Baldosa

# CardTextBlockCourage
source: Courage
es: Coraje

# CardTextBlockFinnTheHuman
source: Finn The Human
es: Finn El Humano

# CardTextBlockHomerSimpson
source: Homer Simpson
es: Homero Simpson

# CardTextBlockJakeTheDog
source: Jake The Dog
es: Jake El Perro

# CardTextBlockKimPossible
source: Kim Possible
es: Kim Posible

# CardTextBlockMrKrabs
source: Mr. Krabs
es: Don Cangrejo

# CardTextBlockNumberOne
source: Number 1
es: Número 1

# CardTextBlockPatrickStar
source: Patrick Star
es: Patricio Estrella

# CardTextBlockPerryThePlatypus
source: Perry The Platypus
es: Perry El Ornitorrinco

# CardTextBlockRickSanchez
source: Rick Sanchez
es: Rick Sánchez

# CardTextBlockSpongeBob
source: Sponge Bob
es: Bob Esponja

# CardTextBlockTommy
source: Tommy Pickles
es: Tommy

# CardTextBlockWoodyWoodpecker
source: Woody Woodpecker
es: El Pájaro Loco

# CardTextBlockReverse
source: Waiting For Card . . .
es: Esperando Carta . . .

# LoginButtonStartGuest
source: Start as guest
es: Iniciar como invitado

# MainMenuButtonLogout
source: Logout
es: Cerrar Sesión

# CodeLengthMessage
source: The verification code must be exactly 6 digits.
es: El código de verificación debe contener exactamente 6 dígitos.

# CodeRequiredMessage
source: The code cannot be empty.
es: El código no puede estar vacío.

# CodeFormatMessage
source: The code can only contain numbers.
es: El código solo puede contener números.

# MaternalLastNameMaxLengthMessage
source: Lastname must contain a maximum of 30 characters.
es: El apellido materno debe contener máximo 30 caracteres.

# EmailInvalidDomainOrCharsMessage
source: Email contains invalid characters or domain.
es: El correo contiene caracteres no permitidos o dominio inválido.

# PaternalLastNameRequiredMessage
source: Lastname is required.
es: El apellido paterno es obligatorio.

# PaternalLastNameMaxLengthMessage
source: Lastname must contain a maximum of 30 characters.
es: El apellido paterno debe contener máximo 30 caracteres.

# PaternalLastNameInvalidCharactersMessage
source: Lastname may only contain letters and spaces.
es: El apellido paterno solo puede contener letras y espacios.

# PasswordRequireUppercaseMessage
source: Password must contain at least one uppercase letter.
es: La contraseña debe contener al menos una letra mayúscula.

# PasswordRequireSpecialCharMessage
source: Password must contain a special character (! @ # $ % & * _ - + =)
es: La contraseña debe contener un carácter especial (! @ # $ % & * _ - + =)

# PasswordRequireNumberMessage
source: Password must contain at least one number.
es: La contraseña debe contener al menos un número.

# PasswordRequireLowercaseMessage
source: Password must contain at least one lowercase letter.
es: La contraseña debe contener al menos una letra minúscula.

# FirstNameMaxLengthMessage
source: The first name must contain a maximum of 30 characters.
es: El nombre debe contener máximo 30 caracteres.

# PasswordMinLengthMessage
source: Password must be at least 8 characters.
es: La contraseña debe tener mínimo 8 caracteres.

# PasswordRequiredMessage
source: Password is required.
es: La contraseña es obligatoria.

# PasswordInvalidCharactersMessage
source: Password contains invalid characters.
es: La contraseña contiene caracteres no permitidos.

# EmailInvalidFormatMessage
source: Invalid email format.
es: Formato de correo electrónico no válido.

# EmailRequiredMessage
source: Email is required.
es: El correo es obligatorio.

# FirstNameInvalidCharactersMessage
source: First name can only contain letters and spaces.
es: El nombre solo puede contener letras y espacios.

# FirstNameRequiredMessage
source: First name is required.
es: El nombre es obligatorio.

# MaternalLastNameInvalidCharactersMessage
source: Lastname may only contain letters and spaces.
es: El apellido materno solo puede contener letras y espacios.

# NicknameRequiredMessage
source: Nickname is required.
es: El nickname es obligatorio.

# NicknameInvalidCharactersMessage
source: Nickname may only contain letters, numbers and _ . - @
es: El nickname solo puede contener letras, números y _ . -

# NicknameMaxLengthMessage
source: The nickname must contain a maximum of 20 allowed characters.
es: El nickname debe contener máximo 20 caracteres permitidos.

# CardTextBlockCatDog
source: CatDog
es: GatoPerro

# NicknameMinLengthMessage
source: Nickname must be at least 4 characters.
es: El nickname debe tener mínimo 4 caracteres.

# FriendRequestsSessionError
source: Session Error
es: Error de Sesión

# FriendRequestsErrorLoadingRequests
source: Error loading requests: {0}
es: Error cargando solicitudes: {0}

# FriendRequestsConnectionError
source: Connection error while loading:
es: Error de conexión al cargar:

# FriendRequestsNowFriendWith
source: Now you're friends with {0}
es: Ahora eres amigo de {0}

# GlobalMessageBoxTitleSuccess
source: Success
es: Éxito

# FriendRequestsRequestCouldNotBeAccepted
source: The friend request could not be accepted
es: No se pudo aceptar la solicitud de amistad

# GlobalMessageBoxUnexpectedError
source: An unexpected error occurred: {0}
es: Ocurrió un error inesperado: {0}

# FriendRequestsRequestCouldNotBeReject
source: The friend request could not be rejected
es: No se pudo rechazar la solicitud de amistad

# FriendRequestsExceptionFriendNotFound
source: This request has already been accepted or cancelled by the other user.
es: Esta solicitud ya fue aceptada o cancelada por el otro usuario.

# FriendRequestsExceptionFriendInvalid
source: The friendship operation is not valid.
es: La operación de amistad no es válida.

# FriendRequestsExceptionFriendDuplicate
source: You are already friends with this user or the request has already been processed.
es: Ya eres amigo de este usuario o la solicitud ya fue procesada.

# FriendRequestsExceptionUserOffline
source: Your session has expired. Please log out and log back in.
es: Tu sesión ha expirado. Por favor cierra sesión y vuelve a entrar.

# FriendRequestsExceptionFR500
source: The server experienced an internal problem. Please try again later.
es: El servidor tuvo un problema interno. Intenta más tarde.

# GlobalExceptionServerError
source: Server Error ({0}): {1}
es: Error del servidor ({0}): {1}

# InviteFriendsErrorLoadingFriends
source: Error loading friends
es: Error al cargar amigos

# InviteFriendsConnectionError
source: Connection Error: {0}
es: Error de conexión: {0}

# InviteFriendsSearch
source: Search
es: Búsqueda

# InviteFriendsSearchError
source: Search Error
es: Error de Búsqueda

# InviteFriendsRequestsSent
source: Requests sent to {0}
es: Solicitud enviada a {0}

# GlobalMessageBoxTitleSent
source: Sent
es: Enviado

# InviteFriendsNotSent
source: Could not be sent
es: No se pudo enviar

# InviteFriendsCancelRequest
source: Friend request cancelled
es: Solicitud de amistad cancelada

# InviteFriendErrorCanceling
source: Error canceling
es: Error al cancelar

# IniviteFriendsSucces
source: {0} is now your friend
es: {0} ahora es tu amigo

# InviteFriendsErrorWhenAccepting
source: Error when accepting
es: Error al aceptar

# InviteFriendsFriendRequestRejected
source: Friend request rejected
es: Solicitud de amistad rechazada

# InviteFriendsErrorWhenRejecting
source: Error when rejecting
es: Error al rechazar

# InviteFriendsAreYouSure
source: Are you sure you want to eliminate {0}?
es: ¿Seguro que quieres eliminar a {0}?

# InviteFriendsErrorWhenDeleting
source: Error when deleting
es: Error al eliminar

# InviteFriendsSucces
source: Invitation sent to {0}
es: Invitación enviada a {0}

# InviteFriendsErrorInvitation
source: Invitation Error
es: Error de invitación

# InviteFriendsExceptionFriendDuplicate
source: There is already a pending application or a friendship with
es: Ya existe una solicitud pendiente o una amistad con

# InviteFriendsExceptionFriendInvalid
source: Invalid friendship transaction.
es: Operación de amistad no válida.

# InviteFriendsExceptionFriendNotFound
source: The friend request does not exist, it has already been accepted or rejected by the other party.
es: La solicitud de amistad no existe, ya fue aceptada o rechazada por la otra parte.

# InviteFriendsExceptionUserNotFound
source: No user with that nickname was found."
es: No se encontró ningún usuario con ese apodo.

# InviteFriendsExceptionUserInLobby
source: The user is already occupied in a lobby.
es: El usuario ya se encuentra ocupado en un lobby.

# InviteFriendsExceptionUserOffline
source: The user is not currently logged in or your session has expired.
es: El usuario no está conectado actualmente o tu sesión expiró.

# InviteFriendsExceptionFriendGuestRestricted
source: You can't invite friends if you're being invited.
es: No puedes invitar amigos siendo invitado.

# GlobalExceptionInternalServerError
source: Internal Server Error
es: Error interno del servidor

# GlobalMessageBoxTitleConfirm
source: Confirm
es: Confirmar

# GameWaitingLetter
source: Waiting for letter . . .
es: Esperando Carta . . .

# GameGameStarted
source: The game has started
es: La partida ha comenzado

# GameCard
source: Card
es: Carta

# GameWonTheGame
source: has won the game
es: ha ganado la partida

# GameEndGame
source: End of the game
es: Fin del juego

# GameGameIsOver
source: The game is over.
es: La partida ha terminado.

# GameGameOver
source: Game Over
es: Juego Finalizado

# GamecheckedAllTheBoxesYet
source: You haven't checked all the boxes yet.
es: Aún no has marcado todas las casillas.

# GlobalMessageBoxTitleWarning
source: Warning
es: Aviso

# GameVerifyingVictory
source: Verifying Victory . . .
es: Verificando Victoria . . .

# GameFailedAttemptAtVictory
source: Failed attempt at victory.
es: Intento de victoria fallido.

# GameInvalidVictory
source: Invalid Victory
es: Victoria Inválida

# GameConnectionErrorVictory
source: Connection error when declaring victory:
es: Error de conexión al declarar victoria:

# GlobalConnectionError
source: Connection Error
es: Error de conexión

# GameAreYouSureLeave
source: Are you sure you want to leave? You'll lose your progress.
es: ¿Seguro que quieres salir? Perderás el progreso.

# GlobalMessageBoxTitleLeave
source: Leave
es: Salir

# GameErrorWhenExiting
source: Error when exiting
es: Error al salir

# MainMenuGuestFriends
source: The guests don't have a friends list.
es: Los invitados no tienen lista de amigos.

# MainMenuRestrictedAccess
source: Restricted Access
es: Acceso Restringido

# MainMenuGuestProfile
source: Guests do not have a profile to edit.
es: Los invitados no tienen perfil para editar.

# MainMenuErrorCreateLobby
source: Error creating lobby
es: Error al Crear Lobby

# MainMenuJoinError
source: Join Error
es: Error al Unirse

# MainMenuHasInvited
source: {0} has invited you to play. Do you want to join?
es: {0} te ha invitado a jugar. ¿Quieres unirte?

# MainMenuCodeLobby
source: Code {0}
es: Código {0}

# MainMenuDoYouWantToJoin
source: Do you want to join?
es: ¿Quieres unirte?

# MainMenuInvitationReceived
source: Invitation Received
es: Invitación Recivida

# MainMenuErrorDuringLogout
source: Error during logout
es: Error durante el cierre de sesión

# MainMenuExceptionRegisteredInAnActiveLobby
source: You are already registered in an active lobby. Please log out first.
es: Ya te encuentras registrado en un lobby activo. Sal primero.

# MainMenuExceptionLobbyFull
source: The lobby has already reached its maximum player capacity.
es: El lobby ya alcanzó su capacidad máxima de jugadores.

# MainMenuExceptionNotFoundLobby
source: The lobby no exists.
es: El lobby no existe.

# MainMenuExceptionSessionExpired
source: Your session has expired. Please log in again.
es: Tu sesión ha expirado. Por favor inicia sesión de nuevo.

# MainMenuExceptionUserBanned
source: You cannot join this lobby because you have been banned.
es: No puedes unirte a este lobby porque has sido expulsado.

# LoginTextBlockSigningIn
source: Signing in . . .
es: Iniciando Sesión . . .

# GameStatusStarted
source: The game has started!
es: ¡La partida ha comenzado!

# GameStatusCardDrawn
source: Drawn: {0}!
es: ¡Salió: {0}!

# GameStatusPlayerWon
source: {0} has won the game!
es: ¡{0} ha ganado la partida!

# GameStatusVerifyingWin
source: Verifying victory...
es: Verificando victoria...

# GameExceptionInvalidAction
source: Warning! Your board doesn't match the drawn cards.
es: ¡Cuidado! Tu tablero no coincide con las cartas cantadas.

# GameExceptionAlreadyActive
source: Game state changed or game already ended.
es: El estado del juego ha cambiado o ya finalizó.

# GameExceptionLobbyNotFound
source: The game or lobby no longer exists.
es: La partida o el lobby ya no existen.

# GameExceptionUserOffline
source: Connection lost with your session.
es: Se perdió la conexión con tu sesión.

# GameExceptionInternalError
source: An internal game server error occurred.
es: Ocurrió un error en el servidor de juego.

# GameTitleGameOver
source: Game Over
es: Fin del Juego

# GameMessageBoxPlayerWon
source: {0} won the match.
es: {0} ha ganado la partida.

# GameTitleGameFinished
source: Game Finished
es: Juego Finalizado

# GameMessageBoxGameEnded
source: The game has ended.
es: La partida ha terminado.

# GameWarningNotAllCellsSelected
source: You haven't marked all cells yet.
es: Aún no has marcado todas las casillas.

# GameWarningLeaveGame
source: Are you sure you want to leave? You will lose progress.
es: ¿Seguro que quieres salir? Perderás el progreso.

# JoinLobbyCodeEmpty
source: Please enter a lobby code.
es: Por favor ingresa un código de lobby.

# JoinLobbyNotFound
source: The code entered does not match any active lobby.
es: El código ingresado no corresponde a ningún lobby activo.

# JoinLobbyFull
source: The lobby has reached its maximum player capacity.
es: El lobby ya alcanzó su capacidad máxima de jugadores.

# JoinLobbyAlreadyIn
source: You are already registered in this lobby (or another one).
es: Ya te encuentras registrado en este lobby (o en otro).

# JoinLobbyBanned
source: You cannot join this lobby because you have been banned.
es: No puedes unirte a este lobby porque has sido expulsado.

# JoinLobbyUserOffline
source: Your session has expired or is invalid.
es: Tu sesión ha expirado o no es válida.

# JoinLobbyInternalError
source: Internal server error while trying to join.
es: Error interno del servidor al intentar unirse.
